DataProcessors/лео_ЗагрузкаИзКалькулятораТрейдМаркетинговыхАктивностей/лео_ЗагрузкаИзКалькулятораТрейдМаркетинговыхАктивностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>лео_ЗагрузкаИзКалькулятораТрейдМаркетинговыхАктивностей</name>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФильтрРасширенияФайлов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасширениеФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицаМаркетинговыхмероприятий</name>
    <attributes>
      <name>КонтрагентНаименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>512</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>СетьНаименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>512</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сеть</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураНаименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>512</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидкиБезНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопОбъём</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Месяц</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидОплаты</name>
      <type>
        <types>EnumRef.абс_ВидыОплатУслугКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидАктивности</name>
      <type>
        <types>CatalogRef.ТипыСкидокНаценок</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерАктивности</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗагруженныеДокументв</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.Лео_ФиксацияСкидокПоТрейдМаркетингу</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Enums/абс_ВидыОплатУслугКонтрагентов/абс_ВидыОплатУслугКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_ВидыОплатУслугКонтрагентов</name>
  <enumValues>
    <name>Безналичная</name>
  </enumValues>
  <enumValues>
    <name>Наличная</name>
  </enumValues>
  <enumValues>
    <name>БесплатнаяОтгрузка</name>
  </enumValues>
  <enumValues>
    <name>ПредоставлениеСкидки</name>
  </enumValues>
  <enumValues>
    <name>Взаимозачет</name>
  </enumValues>
</mdclass:Enum>

Documents/Лео_ФиксацияСкидокПоТрейдМаркетингу/Лео_ФиксацияСкидокПоТрейдМаркетингу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Лео_ФиксацияСкидокПоТрейдМаркетингу</name>
  <basedOn>Document.Лео_ЗаявкаНаАкцию</basedOn>
  <registerRecords>AccumulationRegister.Лно_СкидкиТрейдМаркетинг</registerRecords>
  <registerRecords>AccumulationRegister.Лео_Скидки</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <comment>Дистрибьютор</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерАктивности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидАктивности</name>
    <type>
      <types>CatalogRef.ТипыСкидокНаценок</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодВозникновенияРасхода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛимитБюджетаБезНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОплаты</name>
    <type>
      <types>EnumRef.абс_ВидыОплатУслугКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодтвержениеФактаПредоставленияСкидки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаФактаПредоставленияСкидки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокуменПредоставленияСкидки</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>String</types>
      <types>DocumentRef.Лео_ФиксацияСкидокПоТрейдМаркетингу</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.Лео_ЗаявкаНаАкцию</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Скидки</name>
    <attributes>
      <name>Сеть</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ДопОбъём</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидкиБезНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

DataProcessors/лео_ЗагрузкаИзКалькулятораТрейдМаркетинговыхАктивностей/Forms/Форма1/Module.bsl
&НаКлиенте
Процедура ЗагрузитьДанныеИзФайла(Команда)
	Ф=Новый Файл(СокрЛП(Объект.ИмяФайла));
	Если Ф.Существует()=0 Тогда
		Сообщить("Указанный файл не существует!");
		Возврат;
	КонецЕсли;
	ВыбФайл = Новый Файл(Объект.ИмяФайла);
	Если ВыбФайл.Существует() Тогда
		Объект.РасширениеФайла = ВыбФайл.Расширение;
		Объект.ID = ВыбФайл.ИмяБезРасширения;
	КонецЕсли;
	
	ДвоичныйФайл = ПоместитьВоВременноеХранилище ( Новый ДвоичныеДанные(Объект.ИмяФайла),ЭтаФорма.УникальныйИдентификатор); 
	ПолучитьФайлНаСервере(ДвоичныйФайл);

КонецПроцедуры

&НаСервере
Функция ЗагрузитьМетодом_MSADODB(Знач ФайлEXCEL, Знач ИмяЛиста, Знач СтрокаЗаголовка = 4, НачСтрока = 0, КонСтрока = 0, КолвоСтрокExcel, 
	Знач ПодключениеADODB = "MicrosoftJetOLEDB40") Экспорт
	Перем СonnectionString, ADODBConnection, ADODBRecordset, ТекстЗапроса;
	Перем КолвоКолонокExcel, Поле, Колонка, ИмяКолонки;
	Перем НоваяСтрока, НомерСтроки;
	Перем ТаблицаРезультат;
	
	// Нумерация MS ADODB начинается с 1.
	
	// Переменная "СтрокаЗаголовка", не используется, т.к. HDR=YES, а не HDR=NO.
	// HDR=YES:
	// 1. Считывание заголовков колонок с 1-ой строки.
	// 2. Считываемые данные со 2-ой и последующих строк типизированы. Для варианта HDR=NO: считываемые данные - строка.
	
	// Строка соединения - определение драйвера, который будет использован для подключения к файлу EXCEL.
	Если ПодключениеADODB = "MicrosoftACEOLEDB12" Тогда
		
		// ACE.OLEDB.12.0 - Для использования данного подключения необходимо дополнительное ПО:
		// Microsoft Access Database Engine 2010 Redistributable 32/64 bit.
		//Для корректной работы также установил:
		//http://www.microsoft.com/en-us/download/details.aspx?id=13255
		//http://www.microsoft.com/en-us/download/details.aspx?id=23734		
		
		//СonnectionString = "Provider=Microsoft.ACE.OLEDB.12.0;Data Source= " + СокрЛП(ФайлEXCEL) + ";Extended Properties=""Excel 12.0;HDR=NO;IMEX=1;""";
		
		// Еще один вариант.
		//СтрокаСоединения = "Driver={Microsoft Excel Driver (*.xls, *.xlsx, *.xlsm, *.xlsb)};Dbq=" + СокрЛП(ФайлEXCEL) + ";";
		СonnectionString = "Driver={Microsoft Excel Driver (*.xls, *.xlsx, *.xlsm, *.xlsb)};Dbq=" + СокрЛП(ФайлEXCEL) + ";";
	Иначе
		
		// Jet.OLEDB.4.0 - Стандартное подключение, как правило, не требующее установки дополнительного ПО. 
		// Рекомендуется установить последний Service Pack Windows.
		СonnectionString = "Provider=Microsoft.Jet.OLEDB.4.0;Data Source= "  + СокрЛП(ФайлEXCEL) + ";Extended Properties=""Excel 8.0;HDR=NO;IMEX=1;""";
		
		// Еще один вариант.
		//СтрокаСоединения = "Driver={Microsoft Excel Driver (*.xls)};Dbq=" + СокрЛП(ФайлEXCEL) + ";";
		
	КонецЕсли;
	
	Попытка
		// Инициализация основного объекта ADODB.Connection. Открытие соединения.
		ADODBConnection = Новый COMОбъект("ADODB.Connection");
		ADODBConnection.ConnectionString =  СonnectionString;
		ADODBConnection.Open();
		// Импирически определенный параметр для правильного определения количества строк листа.
		ADODBConnection.CursorLocation = 3;    // По-умолчанию 2.
	Исключение
		Сообщить(НСтр("ru = '"+ОписаниеОшибки()+"'"), СтатусСообщения.Внимание);
		Возврат Новый ТаблицаЗначений;    // В случае ошибки возвращаем пустую таблицу значений.
	КонецПопытки;
	
	ТекстЗапроса = "SELECT * FROM [" + ИмяЛиста + "$]";
	
	// Создание Recordset. Дочерний объект ADODBConnection. Набор записей по запросу.
	Попытка
		ADODBRecordset = Новый COMОбъект("ADODB.Recordset");
		ADODBRecordset.Open(ТекстЗапроса, ADODBConnection);
		
		// Проверка заполненности листа.
		Если (ADODBRecordset.EOF ИЛИ ADODBRecordset.BOF) Тогда
			КолвоСтрокExcel = 0;
			Сообщить(НСтр("ru = '" + ИмяЛиста + ": не содержит данных.'"), СтатусСообщения.Внимание);
			
			// Завершение работы.
			// Закрытие Объектов.
			ADODBRecordset.Close();
			ADODBConnection.Close();
			ADODBRecordset   = Неопределено;
			ADODBConnection = Неопределено;
			
			Возврат Новый ТаблицаЗначений;    // В случае ошибки возвращаем пустую таблицу значений.
		КонецЕсли;
		
		// Импирически определенные параметры для правильного определения количества строк листа.
		ADODBRecordset.AbsolutePage     = 1;
		ADODBRecordset.AbsolutePosition = 1;
	Исключение
		Сообщить(НСтр("ru = '"+ОписаниеОшибки()+"'"), СтатусСообщения.Внимание);
		Возврат Новый ТаблицаЗначений;    // В случае ошибки возвращаем пустую таблицу значений.
	КонецПопытки;
	
	// Параметр, возвращаемый в вызывающую процедуру.
	КолвоСтрокExcel = ADODBRecordset.RecordCount + 1;    // (+1) - учет Строки-Заголовока, которая "съедается".
	КолвоКолонокExcel = ADODBRecordset.Fields.Count;
	
	// Проверка заполненности листа.
	Если КолвоСтрокExcel <= 2 Тогда
		КолвоСтрокExcel = 0;
		Сообщить(НСтр("ru = '" + ИмяЛиста + ": не содержит данных.'"), СтатусСообщения.Внимание);
		
		// Завершение работы.
		// Закрытие Объектов.
		ADODBRecordset.Close();
		ADODBConnection.Close();
		ADODBRecordset   = Неопределено;
		ADODBConnection = Неопределено;
		
		Возврат Новый ТаблицаЗначений;    // В случае ошибки возвращаем пустую таблицу значений.
	КонецЕсли;
	
	// Создание результирующей таблицы, в которую будут записываться считанные из EXCEL данные.
	ТаблицаРезультат = Новый ТаблицаЗначений;
	
	// Формирование колонок результирующей таблицы.
	
	// "НомерСтроки" - для наглядности и удобства.
	// В зависимости от разрабатываемой обработки.
	// "Сопоставлено" - может быть другим.
	// Здесь же могут быть добавлены другие колонки, не формируемые из содержимого файла EXCEL.
	
	//ТаблицаРезультат.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"), "№", 4);
	//ТаблицаРезультат.Колонки.Добавить("Сопоставлено", Новый ОписаниеТипов("Булево"), "Сопоставлено", 1);
	
	Для ит = 1 ПО КолвоКолонокExcel Цикл
		
		Поле = ADODBRecordset.Fields.Item(ит - 1);
		ИмяКолонки = "К_" + ит;
		//ИмяКолонки = Поле.Value;
		//Колонка = ТаблицаРезультат.Колонки.Добавить(ИмяКолонки, , СокрЛП(СтрЗаменить(Поле.Name, "#", ".")));
		ИмяКолонки = ЗаменитьСимволы(ИмяКолонки);
		Колонка = ТаблицаРезультат.Колонки.Добавить(ИмяКолонки, ,ИмяКолонки);
		
		// Замена "#" на ".", т.к. при считывании ADODB "." в имени колонки заменяется на "#".
	КонецЦикла;
	
	// ТаблицаРезультат: 1-я строка - Строка-Заголовок.
	
	// Добавление этой строки обусловлено исключительно из соображений идентичности содержимого файла EXCEL и ТаблицыЗначений,
	// выводимой на форме Обработки, и дальнейшей обработки строки заголовка
	// с целью сопоставления колонок EXCEL и реквизитов 1С: для Справочников, ПВХ, Регистров, Документов.
	
	// Если в Вашей обработке в результирующей таблице в качестве 1-ой строки не нужна Строка-Заголовок, то
	// следует закомментировать следующий цикл:
	//НоваяСтрока = ТаблицаРезультат.Добавить();
	//НоваяСтрока.НомерСтроки = 1;
	//Для ит = 1 ПО КолвоКолонокExcel Цикл
	//	
	//	ИмяКолонки = "К_" + ит;
	//	Колонка = ТаблицаРезультат.Колонки.Найти(ИмяКолонки);
	//	НоваяСтрока[ИмяКолонки] = Колонка.Заголовок;
	//	
	//КонецЦикла;
	
	// ТаблицаРезультат: Формирование строк по указанному диапазону: НачСтрока - КонСтрока.
	
	НомерСтроки = 1;
	НачСтрока =  СтрокаЗаголовка+1;
	Пока ADODBRecordset.EOF() = 0 Цикл
		
		//НомерСтроки = НомерСтроки + 1;
		
		Если НомерСтроки < НачСтрока Тогда    // Номер строки вне диапазона считываемых строк.
			ADODBRecordset.MoveNext();             // Следующая строка.
			//Продолжить;
			НомерСтроки = НомерСтроки + 1;
			Продолжить;
		КонецЕсли;
		
		Если КонСтрока > 0 И НомерСтроки > КонСтрока Тогда    // Номер строки вне диапазона считываемых строк.
			Прервать;
		КонецЕсли;
		
		НомерСтроки = НомерСтроки + 1;
		
		НоваяСтрока = ТаблицаРезультат.Добавить();
		//НоваяСтрока.НомерСтроки = НомерСтроки;
		
		Для ит = 1 ПО КолвоКолонокExcel Цикл
			
			Поле = ADODBRecordset.Fields.Item(ит - 1);
			
			Если Поле.ActualSize = 0 Тогда        // Пустое поле EXCEL.
				Продолжить;
			КонецЕсли;
			
			ЗначениеЯчейки = Поле.Value;        // Учитывая параметр HDR=YES в строке соединения, данные считываются в соответствии с их типом.
			
			ИмяКолонки = ит-1;
			НоваяСтрока[ИмяКолонки] = ЗначениеЯчейки;
			
			// Используется при формировании таблицы на форме обработки.
			//ШиринаКолонки = ТаблицаРезультат.Колонки[ИмяКолонки].Ширина;
			//ДлинаСтроки      = СтрДлина(СокрЛП(ЗначениеЯчейки));
			//ТаблицаРезультат.Колонки[ИмяКолонки].Ширина = ?(ШиринаКолонки < ДлинаСтроки, ДлинаСтроки, ШиринаКолонки);
			
		КонецЦикла;
		
		ADODBRecordset.MoveNext();   // Следующая строка.
		
	КонецЦикла;
	
	//УдалитьКолонкиСНулевойШириной(ТаблицаРезультат);
	
	// Завершение работы.
	// Закрытие Объектов.
	ADODBRecordset.Close();
	ADODBConnection.Close();
	ADODBRecordset   = Неопределено;
	ADODBConnection = Неопределено;
	
	Возврат ТаблицаРезультат;
	
КонецФункции

&НаСервере
Процедура ПолучитьФайлНаСервере(ДвоичныйФайл);
	
	Объект.ТаблицаМаркетинговыхмероприятий.Очистить();
	ДанныеДокумента = ПолучитьИзВременногоХранилища(ДвоичныйФайл);
	ИмяФайлаДляЗагрузки = КаталогВременныхФайлов()+"temp" + Объект.ID + Объект.РасширениеФайла;
	ДанныеДокумента.Записать(ИмяФайлаДляЗагрузки);

	
	ФайлEXCEL = ИмяФайлаДляЗагрузки ;
	ИмяЛиста = "1С";
	КолвоСтрокExcel = 1;
	ТаблицаИзФайла = ЗагрузитьМетодом_MSADODB(ФайлEXCEL,ИмяЛиста,0,,, КолвоСтрокExcel,"MicrosoftACEOLEDB12");
		
	//("КонтрагентНаименование") //К_1
	//("месяц")               	//К_2
	//("ВидОплаты")           	//К_3
	//("ВидАктивности")       	//К_4
	//("НомерАктивности")		//К_5
	//("Сеть")      			//К_6
	//("Номенклатура")   		//К_7
	//("СуммаСкидкиСНДС")   	//К_8
	//("СуммаСкидкиБезНДС")   	//К_9
	//("ДопОбъем");     	   	//К_10

	Для каждого Строка из ТаблицаИзФайла Цикл
		Если Строка.К_1 = Неопределено И
			 	Строка.К_2 = Неопределено И
			 	Строка.К_3 = Неопределено И
			 	Строка.К_4 = Неопределено И
				 Строка.К_5 = Неопределено И
				 Строка.К_6 = Неопределено И
				 Строка.К_7 = Неопределено И
				 Строка.К_8 = Неопределено И
				 Строка.К_9 = Неопределено И
				 Строка.К_10 = Неопределено Тогда
			Продолжить	 
		
		КонецЕсли;
			 
			 
		ТекСтр = Объект.ТаблицаМаркетинговыхмероприятий.Добавить();
		
		Если Не Строка.К_7 = Неопределено Тогда
			Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию(Строка.К_7);
		Иначе
			Номенклатура =  неопределено;
		КонецЕсли;
		
		Если Не Строка.К_1 = Неопределено Тогда
			Контрагент 	 = Справочники.Контрагенты.НайтиПоНаименованию(Строка.К_1);
		Иначе
			Контрагент =  неопределено;
		КонецЕсли;

		Если Не Строка.К_6 = Неопределено Тогда
			Сеть = Справочники.Контрагенты.НайтиПоНаименованию(Строка.К_6);
		Иначе
			Сеть =  неопределено;
		КонецЕсли;

		
		Если Строка.К_3 = "Предоставление скидки" Тогда
			ВидОплаты = Перечисления.абс_ВидыОплатУслугКонтрагентов.ПредоставлениеСкидки;
		ИначеЕсли Строка.К_3 = "Взаимозачет"  Тогда
			ВидОплаты = Перечисления.абс_ВидыОплатУслугКонтрагентов.Взаимозачет;
		ИначеЕсли Строка.К_3 = "Бесплатная отгрузка"  Тогда
			ВидОплаты = Перечисления.абс_ВидыОплатУслугКонтрагентов.БесплатнаяОтгрузка;
		ИначеЕсли Строка.К_3 = "Наличная"  Тогда
			ВидОплаты = Перечисления.абс_ВидыОплатУслугКонтрагентов.Наличная;
	    ИначеЕсли Строка.К_3 = "Безналичный расчет"  Тогда
			ВидОплаты = Перечисления.абс_ВидыОплатУслугКонтрагентов.Безналичная;
		Иначе
			ВидОплаты = Перечисления.абс_ВидыОплатУслугКонтрагентов.ПустаяСсылка(); 
		КонецЕсли;	
		
		Если не Строка.К_4 = "" Тогда
			ВидАктивности = Справочники.ТипыСкидокНаценок.НайтиПоНаименованию(Строка.К_4);
        КонецЕсли;
		
		ТекСтр.КонтрагентНаименование   = Строка.К_1;
		ТекСтр.СетьНаименование         = Строка.К_6;
		ТекСтр.НоменклатураНаименование = Строка.К_7;
		
		Если Не Контрагент = Неопределено Тогда
			ТекСтр.Контрагент = Контрагент;
		Иначе
			ТекСтр.Контрагент = Справочники.Контрагенты.ПустаяСсылка();
		КонецЕсли;

		Если Не Сеть = Неопределено Тогда
			ТекСтр.Сеть = Сеть;
		Иначе
			ТекСтр.Сеть = Справочники.Контрагенты.ПустаяСсылка();
		КонецЕсли;
		
		Если Не Номенклатура = Неопределено Тогда
			ТекСтр.Номенклатура = Номенклатура;
		Иначе
			ТекСтр.Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
		КонецЕсли;
		
		ТекСтр.ВидОплаты = ВидОплаты;

		Если Не ВидАктивности = Неопределено Тогда
			ТекСтр.ВидАктивности = ВидАктивности;
		Иначе
			ТекСтр.ВидАктивности = Справочники.ТипыСкидокНаценок.ПустаяСсылка();
		КонецЕсли;

		
		ТекСтр.месяц              		= Строка.К_2;
		ТекСтр.НомерАктивности    		= Строка.К_5;
		
		ТекСтр.СуммаСкидки			    = Строка.К_8;
		ТекСтр.СуммаСкидкиБезНДС		= Строка.К_9;
		ТекСтр.ДопОбъём           		= Строка.К_10;		
	КонецЦикла;
	   
   Сообщить("Файл прочитан!");
	
КонецПроцедуры


&НаСервере
Функция ЗаменитьСимволы(Стр)
	Стр = СтрЗаменить(Стр, "-", "");
	Стр = СтрЗаменить(Стр, "/", "");
	Стр = СтрЗаменить(Стр, ":", "");
	Стр = СтрЗаменить(Стр, ".", "");
	Стр = СтрЗаменить(Стр, "№", "");
	Стр = СтрЗаменить(Стр, "(", "");
	Стр = СтрЗаменить(Стр, ")", "");
	Возврат Стр;
КонецФункции

&НаКлиенте
Процедура ФайлНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Объект.ФильтрРасширенияФайлов = "" Тогда
		Объект.ФильтрРасширенияФайлов = "Документ Exel (*.xls)|*.xls|Документ Exel 2007(*.xlsx)|*.xlsx|Документ Exel(*.xlsm)|*.xlsm";
	КонецЕсли;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр = "Документ Exel (*.xls)|*.xls|Документ Exel 2007(*.xlsx)|*.xlsx|Документ Exel(*.xlsm)|*.xlsm";//Объект.ФильтрРасширенияФайлов;
	Если Диалог.Выбрать() Тогда
		Объект.ИмяФайла = Диалог.ПолноеИмяФайла; 
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура ФайлОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗапуститьПриложение(Объект.ИмяФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	СоздатьДокументыЛео_ФиксацияСкидокПоТрейдМаркетингу ()	
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументыЛео_ФиксацияСкидокПоТрейдМаркетингу ()
	
	Если НЕ Объект.ТаблицаМаркетинговыхмероприятий.Количество()> 0 Тогда 
		Возврат	
	КонецЕсли;
	Объект.ЗагруженныеДокументв.Очистить();
	
	СтрокиШапки = Объект.ТаблицаМаркетинговыхмероприятий.Выгрузить(,"КонтрагентНаименование,Контрагент,ВидОплаты,ВидАктивности,НомерАктивности,Месяц");
	СтрокиШапки.Свернуть("КонтрагентНаименование,Контрагент,ВидОплаты,ВидАктивности,НомерАктивности,Месяц");
	
	Для каждого ШапкаДокумента из СтрокиШапки Цикл
		
		НовыйДокумент = Документы.Лео_ФиксацияСкидокПоТрейдМаркетингу.СоздатьДокумент();
		СуммаДокумента = 0;
		
	    НовыйДокумент.Дата = ТекущаяДата();
		НовыйДокумент.Организация 		= Справочники.Организации.НайтиПоКоду("О00000001");
		НовыйДокумент.ВидАктивности 	= ШапкаДокумента.ВидАктивности;
		НовыйДокумент.ВидОплаты			= ШапкаДокумента.ВидОплаты;
		НовыйДокумент.Контрагент 		= ШапкаДокумента.Контрагент;
		НовыйДокумент.НомерАктивности 	= "" + ШапкаДокумента.НомерАктивности;
		НовыйДокумент.Ответственный 	= ПараметрыСеанса.ТекущийПользователь;;
		НовыйДокумент.ПериодВозникновенияРасхода = ШапкаДокумента.Месяц;
		
		ПареметрыОтбора = новый Структура();
        ПареметрыОтбора.Вставить("Контрагент",ШапкаДокумента.Контрагент);
		ПареметрыОтбора.Вставить("ВидОплаты",ШапкаДокумента.ВидОплаты);
        ПареметрыОтбора.Вставить("ВидАктивности",ШапкаДокумента.ВидАктивности);
        ПареметрыОтбора.Вставить("НомерАктивности",ШапкаДокумента.НомерАктивности);
        ПареметрыОтбора.Вставить("Месяц",ШапкаДокумента.Месяц);

		СтрокиДокумента = Объект.ТаблицаМаркетинговыхмероприятий.Выгрузить(ПареметрыОтбора,);
		
        Для каждого Строка из СтрокиДокумента Цикл
        	СтрокаДокумента = НовыйДокумент.Скидки.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДокумента,Строка )
		КонецЦикла;
	  	НовыйДокумент.СуммаДокумента = НовыйДокумент.Скидки.Итог("СуммаСкидки");
        НовыйДокумент.Записать();
		
		СтрокаЗагруженно = Объект.ЗагруженныеДокументв.Добавить();
		СтрокаЗагруженно.Документ = НовыйДокумент.Ссылка;
	КонецЦикла;
	
	Сообщить("Документы созданы!");

КонецПроцедуры
